invocation/core/src/test/resources/test_monitoring.soap

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.monitoring.ngsee.sti2.at/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:invoke>
         <soapRequest><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dum="http://sesa.sti2.at/services/">
   <soapenv:Header/>
   <soapenv:Body>
      <dum:getRandomNumberAndCalculationTime>
         <number>10</number>
      </dum:getRandomNumberAndCalculationTime>
   </soapenv:Body>
</soapenv:Envelope>]]></soapRequest>
      </web:invoke>
   </soapenv:Body>
</soapenv:Envelope>